#!/usr/bin/python
# -*- coding: utf-8 -*-

import urllib2
import json
import requests
import re
import time
from bs4 import BeautifulSoup

lyric_text_2 = '''[00:00.00] 作曲 : 郑楠\n[00:01.00] 作词 : 郑楠/施人诚\n[00:03.01]编曲：于韵非\n[00:03.03]混音：顾潇予\n[00:03.06]扁担宽 板凳长\n[00:04.84]扁担想绑在板凳上\n[00:07.24]扁担宽 板凳长\n[00:09.56]扁担想绑在板凳上\n[00:11.79]\n[00:12.21]伦敦玛丽莲 买了件旗袍送妈妈\n[00:14.53]莫斯科的夫斯基爱上牛肉面疙瘩\n[00:17.12]各种颜色的皮肤 各种颜色的头发\n[00:19.54]嘴里念的说的开始流行中国话\n[00:21.39]\n[00:21.98]多少年我们苦练英文发音和文法\n[00:24.25]这几年换他们卷着舌头学平上去入的变化\n[00:27.38]平平仄仄平平仄\n[00:28.53]好聪明的中国人 好优美的中国话\n[00:30.75]\n[00:31.27]扁担宽 板凳长\n[00:32.35]扁担想绑在板凳上\n[00:33.49]板凳不让扁担绑在板凳上\n[00:35.32]扁担偏要绑在板凳上\n[00:36.70]板凳偏偏不让扁担绑在那板凳上\n[00:38.96]到底扁担宽还是板凳长\n[00:40.35]\n[00:40.74]哥哥弟弟坡前坐\n[00:41.93]坡上卧着一只鹅\n[00:43.12]坡下流着一条河\n[00:44.33]哥哥说 宽宽的河\n[00:45.47]弟弟说 白白的鹅\n[00:46.68]鹅要过河 河要渡鹅\n[00:48.50]不知是那鹅过河\n[00:49.81]还是河渡鹅\n[00:50.03]\n[00:50.13]全世界都在学中国话\n[00:54.40]孔夫子的话 越来越国际化\n[00:59.35]全世界都在讲中国话\n[01:04.10]我们说的话 让世界都认真听话\n[01:14.23]\n[01:19.57]纽约苏珊娜 开了间禅风Lounge Bar\n[01:21.85]柏林来的沃夫冈 拿胡琴配着电吉他\n[01:24.33]各种颜色的皮肤 各种颜色的头发\n[01:26.65]嘴里念的说的开始流行中国话\n[01:29.17]多少年我们苦练英文发音和文法\n[01:31.40]这几年换他们卷着舌头学平上去入的变化\n[01:34.57]仄仄平平仄仄平\n[01:35.84]好聪明的中国人 好优美的中国话\n[01:38.01]\n[01:38.35]有个小孩叫小杜\n[01:39.55]上街打醋又买布\n[01:40.69]买了布 打了醋\n[01:41.88]回头看见鹰抓兔\n[01:43.12]放下布 搁下醋\n[01:44.26]上前去追鹰和兔\n[01:45.46]飞了鹰 跑了兔\n[01:46.68]洒了醋 湿了布\n[01:47.80]\n[01:48.14]嘴说腿 腿说嘴\n[01:49.24]嘴说腿 爱跑腿\n[01:50.36]腿说嘴 爱卖嘴\n[01:51.46]光动嘴 不动腿\n[01:52.66]光动腿 不动嘴\n[01:53.88]不如不长腿和嘴\n[01:55.14]到底是那嘴说腿 还是腿说嘴\n[01:57.07]\n[01:57.27]全世界都在学中国话\n[02:01.54]孔夫子的话 越来越国际化\n[02:06.35]全世界都在讲中国话\n[02:11.35]我们说的话 让世界都认真听话\n[02:20.96]\n[02:25.91]全世界都在学中国话\n[02:30.46]孔夫子的话 越来越国际化\n[02:35.15]全世界都在讲中国话\n[02:39.97]我们说的话 让世界都认真听话\n[02:51.55]\n'''
lyric_text_3 = '''by:X蓝色青瓷K]\n[ti:致终将逝去的青春（暖行版）]\n[ar:茶季杨]\n[al:致终将逝去的青春]\n[by:X蓝色青瓷K]\n[00:00.00] 作曲 : 茶季杨\n[00:00.360] 作词 : 茶季杨\n[00:01.80]编曲：陈末\n[00:02.80]\n[00:03.80]吉他：刘翊\n[00:04.80]贝斯：姚继\n[00:05.80]大提琴：李维\n[00:06.80]鼓：孙权\n[00:07.80]和声：茶季杨\n[00:08.80]录音师：张小旭\n[00:09.80]录音棚：悦声无限录音棚\n[00:10.80]缩混：全相彦（韩国）\n[00:11.80]母带处理：全相彦（韩国）\n[00:28.80]那些逝去的老去的时光里\n[00:31.95]我们的故事在夕阳里散去\n[00:36.48]那些错过的离去的人群里\n[00:39.81]我们的故事在等待中散去\n[00:44.59]那些苍白的无力的誓言里\n[00:47.91]我们的故事在光阴里老去\n[00:52.64]那些凌乱的破碎的电影里\n[00:55.88]我们的故事在序幕里散场\n[01:16.76]那些逝去的老去的时光里\n[01:19.88]我们的故事在夕阳里散去\n[01:24.53]那些错过的离去的人群里\n[01:27.94]我们的故事在等待中散去\n[01:32.56]那些苍白的无力的誓言里\n[01:36.17]我们的故事在光阴里老去\n[01:40.86]那些凌乱的破碎的电影里\n[01:44.56]我们的故事在序幕里散场\n[01:48.94]老去的时光啊\n[01:52.84]故事不会变老\n[01:56.84]离去的人群啊\n[02:00.61]变得越来越远\n[02:04.73]无力的誓言啊\n[02:08.45]让她随风飘走\n[02:12.83]凌乱的电影啊\n[02:16.54]看着自己流泪\n[02:53.14]老去的时光啊\n[02:56.71]故事不会变老\n[03:01.00]离去的人群啊\n[03:04.76]变得越来越远\n[03:08.83]无力的誓言啊\n[03:12.85]让她随风飘走\n[03:16.88]凌乱的电影啊\n[03:20.69]看着自己流泪\n'''

lyric_text_1 = '''[00:00.00] 作曲 : 刘珂矣/百慕三石
[00:01.00] 作词 : 刘珂矣/百慕三石
[00:25.970]墨已入水     渡一池青花
[00:31.740]揽五分红霞   采竹回家
[00:38.020]悠悠风来     埋一地桑麻
[00:44.290]一身袈裟     把相思放下
[00:49.740]
[00:50.170]十里桃花     待嫁的年华
[00:56.720]凤冠的珍珠   挽进头发
[01:02.340]檀香拂过     玉镯弄轻纱
[01:08.610]空留一盏     芽色的清茶
[01:13.910]
[01:15.180]倘若我心中的山水 你眼中都看到
[01:21.820]我便一步一莲花祈祷
[01:26.930]怎知那浮生一片草 岁月催人老
[01:34.090]风月花鸟 一笑尘缘了
[01:38.890]
[02:03.830]十里桃花     待嫁的年华
[02:09.540]凤冠的珍珠   挽进头发
[02:15.490]檀香拂过     玉镯弄轻纱
[02:21.860]空留一盏     芽色的清茶
[02:27.370]
[02:28.110]倘若我心中的山水 你眼中都看到
[02:35.250]我便一步一莲花祈祷
[02:40.160]怎知那浮生一片草 岁月催人老
[02:47.370]风月花鸟 一笑尘缘了
[02:52.560]倘若我心中的山水 你眼中都看到
[02:59.670]我便一步一莲花祈祷
[03:04.660]怎知那浮生一片草 岁月催人老
[03:11.910]风月花鸟 一笑尘缘了
[03:16.690]
[03:17.130]怎知那浮生一片草 岁月催人老
[03:24.130]风月花鸟 一笑尘缘了'''


def getSongList():
    response = requests.get("https://music.163.com/#/discover/artist")
    print response.text
    soup = BeautifulSoup(response.content, 'html.parser', from_encoding='utf-8')
    print soup.find('div', attrs={"class": "j-showoff u-showoff f-hide"})


def downloadLrcById(id):
    url = 'https://music.163.com/api/song/lyric?id=' + id + '&lv=1&kv=1&tv=-1'
    # data = urllib2.urlopen(url).read()
    response = requests.get(url)
    print response.content
    return response.json()["lrc"]["lyric"]


def process_lrc(lrc):
    lines = lrc.split('\n')
    newlines = []
    author = None
    for line in lines:
        if len(line) != 0 and (':' not in line) and ('：' not in line):
            if line not in newlines:
                newlines.append(line)
        elif len(line) != 0:
            p = re.compile(r"^(作词)(:|：)")
            match = re.match(p, line)
            if match is not None:
                parts = line.split(':')
                if len(parts) < 2:
                    parts = line.split('：')
                if len(parts) > 1:
                    author = parts[1]
    return newlines, author


# downloadLrcById('471385043')
# lrc = downloadLrcById('28793140').encode('utf8')
# print lrc

def clear_lrc(lrc):
    # remove time line
    pattern = re.compile("\[.+\]")
    tup1 = re.subn(pattern, "", lrc)
    lrc = tup1[0]
    # remove all spaces
    pattern = re.compile(r" +")
    tup1 = re.subn(pattern, "", lrc)
    lrc = tup1[0]
    return lrc


lyric_text_2 = clear_lrc(lyric_text_2)

print lyric_text_2

lrc_lines, author = process_lrc(lyric_text_2)

print author
for line in lrc_lines:
    print line
